#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.project-vpc.aws_eip.Nat-Gateway-EIP,
  on modules/vpc/main.tf line 105, in resource "aws_eip" "Nat-Gateway-EIP":
 105:   vpc = true

use domain attribute instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.project-vpc.aws_eip.Nat-Gateway-EIP will be created
  + resource "aws_eip" "Nat-Gateway-EIP" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.project-vpc.aws_internet_gateway.project_igw will be created
  + resource "aws_internet_gateway" "project_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "project_igw"
        }
      + tags_all = {
          + "Name" = "project_igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.project-vpc.aws_nat_gateway.cloudNAT will be created
  + resource "aws_nat_gateway" "cloudNAT" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NAT-1"
        }
      + tags_all                           = {
          + "Name" = "NAT-1"
        }
    }

  # module.project-vpc.aws_route.project_rt will be created
  + resource "aws_route" "project_rt" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.project-vpc.aws_route_table.NAT-Gateway-RT will be created
  + resource "aws_route_table" "NAT-Gateway-RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "RT for NAT-Gw"
        }
      + tags_all         = {
          + "Name" = "RT for NAT-Gw"
        }
      + vpc_id           = (known after apply)
    }

  # module.project-vpc.aws_route_table.project_rtb will be created
  + resource "aws_route_table" "project_rtb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "project_rtb"
        }
      + tags_all         = {
          + "Name" = "project_rtb"
        }
      + vpc_id           = (known after apply)
    }

  # module.project-vpc.aws_route_table_association.Nat-Gw-RT-AssociationA will be created
  + resource "aws_route_table_association" "Nat-Gw-RT-AssociationA" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-vpc.aws_route_table_association.Nat-Gw-RT-AssociationB will be created
  + resource "aws_route_table_association" "Nat-Gw-RT-AssociationB" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-vpc.aws_route_table_association.project_rtb_assoc1 will be created
  + resource "aws_route_table_association" "project_rtb_assoc1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-vpc.aws_route_table_association.project_rtb_assoc2 will be created
  + resource "aws_route_table_association" "project_rtb_assoc2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-vpc.aws_subnet.project_privateA will be created
  + resource "aws_subnet" "project_privateA" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project_privateA"
        }
      + tags_all                                       = {
          + "Name" = "project_privateA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-vpc.aws_subnet.project_privateB will be created
  + resource "aws_subnet" "project_privateB" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project_privateB"
        }
      + tags_all                                       = {
          + "Name" = "project_privateB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-vpc.aws_subnet.project_privateC will be created
  + resource "aws_subnet" "project_privateC" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project_privateC"
        }
      + tags_all                                       = {
          + "Name" = "project_privateC"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-vpc.aws_subnet.project_publicA will be created
  + resource "aws_subnet" "project_publicA" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project_publicA"
        }
      + tags_all                                       = {
          + "Name" = "project_publicA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-vpc.aws_subnet.project_publicB will be created
  + resource "aws_subnet" "project_publicB" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project_publicB"
        }
      + tags_all                                       = {
          + "Name" = "project_publicB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-vpc.aws_subnet.project_publicC will be created
  + resource "aws_subnet" "project_publicC" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project_publicC"
        }
      + tags_all                                       = {
          + "Name" = "project_publicC"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-vpc.aws_vpc.project_vpc will be created
  + resource "aws_vpc" "project_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "project_vpc_test"
        }
      + tags_all                             = {
          + "Name" = "project_vpc_test"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.project-vpc.aws_eip.Nat-Gateway-EIP,
  on modules/vpc/main.tf line 105, in resource "aws_eip" "Nat-Gateway-EIP":
 105:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @LeoPincle, Action: `pull_request`*